Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendRadius.ArcReferenceType
A choice of rule for measuring the radius.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendRadius.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.RebarShapeArcReferenceType)
Create a 180-degree bend constraint driven by radius.
paramId:
The Id of a Rebar Shape parameter.
refType:
A choice of rule for measuring the radius.
Throws Autodesk.Revit.Exceptions.ArgumentException:
paramId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendRadius
A constraint which can be applied to a RebarShapeSegment, and causes the segment
to be replaced with a 180-degree arc. The associated parameter drives
the radius of the arc.
Since:
2012